### OpenTofu Plan Results 豆腐

✅ **Plan successful** - Infrastructure changes detected

**Next Steps:**
1. Review the plan output below
2. Merge this PR to enable production deployment
3. Use the **Tofu Production Deploy** workflow to apply changes

<details>
<summary>Show Plan Output</summary>

```
data.azurerm_resource_group.main: Reading...
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wNGIwNzc5NS04ZGRiLTQ2MWEtYmJlZS0wMmY5ZTFiZjdiNDY7b2JqZWN0SWQ9YWE1YTYwYmUtZWQ2Ny00NWRlLTk4NDUtY2Y5NDg2YmExZGQ1O3N1YnNjcmlwdGlvbklkPWFlZTBjYmQyLTgwNzQtNDAwMS1iNjEwLTBmOGVkYjRlYWEzYzt0ZW5hbnRJZD0yMjM2YjVlNC04MWQyLTRkODItYmRlNS0xN2IxMDM3OTk5ZWE=]
data.azurerm_resource_group.main: Read complete after 0s [id=/subscriptions/aee0cbd2-8074-4001-b610-0f8edb4eaa3c/resourceGroups/infra]
azurerm_dns_zone.main: Refreshing state... [id=/subscriptions/aee0cbd2-8074-4001-b610-0f8edb4eaa3c/resourceGroups/infra/providers/Microsoft.Network/dnsZones/romaine.life]
azurerm_dns_txt_record.spf: Refreshing state... [id=/subscriptions/aee0cbd2-8074-4001-b610-0f8edb4eaa3c/resourceGroups/infra/providers/Microsoft.Network/dnsZones/romaine.life/TXT/@]
azurerm_dns_cname_record.autodiscover: Refreshing state... [id=/subscriptions/aee0cbd2-8074-4001-b610-0f8edb4eaa3c/resourceGroups/infra/providers/Microsoft.Network/dnsZones/romaine.life/CNAME/autodiscover]
azurerm_dns_cname_record.autoconfig: Refreshing state... [id=/subscriptions/aee0cbd2-8074-4001-b610-0f8edb4eaa3c/resourceGroups/infra/providers/Microsoft.Network/dnsZones/romaine.life/CNAME/autoconfig]
azurerm_dns_mx_record.email: Refreshing state... [id=/subscriptions/aee0cbd2-8074-4001-b610-0f8edb4eaa3c/resourceGroups/infra/providers/Microsoft.Network/dnsZones/romaine.life/MX/@]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # azurerm_container_app_environment.main will be created
  + resource "azurerm_container_app_environment" "main" {
      + custom_domain_verification_id    = (known after apply)
      + default_domain                   = (known after apply)
      + docker_bridge_cidr               = (known after apply)
      + id                               = (known after apply)
      + internal_load_balancer_enabled   = false
      + location                         = "westus2"
      + logs_destination                 = (known after apply)
      + mutual_tls_enabled               = false
      + name                             = "infra-aca"
      + platform_reserved_cidr           = (known after apply)
      + platform_reserved_dns_ip_address = (known after apply)
      + public_network_access            = (known after apply)
      + resource_group_name              = "infra"
      + static_ip_address                = (known after apply)
      + tags                             = {
          + "Environment" = "Production"
          + "ManagedBy"   = "Terraform"
          + "Purpose"     = "Container Apps"
        }
      + zone_redundancy_enabled          = false
    }

  # azurerm_cosmosdb_account.main will be created
  + resource "azurerm_cosmosdb_account" "main" {
      + access_key_metadata_writes_enabled           = true
      + analytical_storage_enabled                   = false
      + automatic_failover_enabled                   = false
      + burst_capacity_enabled                       = false
      + create_mode                                  = (known after apply)
      + default_identity_type                        = "FirstPartyIdentity"
      + endpoint                                     = (known after apply)
      + free_tier_enabled                            = true
      + id                                           = (known after apply)
      + is_virtual_network_filter_enabled            = false
      + kind                                         = "GlobalDocumentDB"
      + local_authentication_disabled                = false
      + location                                     = "westus2"
      + minimal_tls_version                          = "Tls12"
      + mongo_server_version                         = (known after apply)
      + multiple_write_locations_enabled             = false
      + name                                         = "infra-cosmos"
      + network_acl_bypass_for_azure_services        = false
      + offer_type                                   = "Standard"
      + partition_merge_enabled                      = false
      + primary_key                                  = (sensitive value)
      + primary_mongodb_connection_string            = (sensitive value)
      + primary_readonly_key                         = (sensitive value)
      + primary_readonly_mongodb_connection_string   = (sensitive value)
      + primary_readonly_sql_connection_string       = (sensitive value)
      + primary_sql_connection_string                = (sensitive value)
      + public_network_access_enabled                = true
      + read_endpoints                               = (known after apply)
      + resource_group_name                          = "infra"
      + secondary_key                                = (sensitive value)
      + secondary_mongodb_connection_string          = (sensitive value)
      + secondary_readonly_key                       = (sensitive value)
      + secondary_readonly_mongodb_connection_string = (sensitive value)
      + secondary_readonly_sql_connection_string     = (sensitive value)
      + secondary_sql_connection_string              = (sensitive value)
      + tags                                         = {
          + "Environment" = "Production"
          + "ManagedBy"   = "Terraform"
          + "Purpose"     = "Database"
        }
      + write_endpoints                              = (known after apply)

      + analytical_storage (known after apply)

      + backup (known after apply)

      + capabilities (known after apply)

      + capacity (known after apply)

      + consistency_policy {
          + consistency_level = "Session"
        }

      + geo_location {
          + failover_priority = 0
          + id                = (known after apply)
          + location          = "westus2"
          + zone_redundant    = false
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + container_app_environment_id   = (known after apply)
  + container_app_environment_name = "infra-aca"
  + cosmos_db_account_id           = (known after apply)
  + cosmos_db_account_name         = "infra-cosmos"
  + cosmos_db_endpoint             = (known after apply)
  ~ usage_instructions             = <<-EOT
        ====================================================================================================
        Shared Infrastructure - Successfully Deployed
        ====================================================================================================
          
        This infrastructure provides shared resources for all applications:
          
        ✅ Resource Group:  infra
        ✅ Location:        westus2
        ✅ DNS Zone:        romaine.life
        ✅ Nameservers:     ns1-07.azure-dns.com., ns2-07.azure-dns.net., ns3-07.azure-dns.org., ns4-07.azure-dns.info.
          
        ====================================================================================================
        Deploying Applications
        ====================================================================================================
          
        To deploy an application, use the azure-app module in your app repository:
          
        1. Create a new app repository (e.g., workout-app, notes-app)
          
        2. Add Terraform configuration referencing this infra state:
          
           data "terraform_remote_state" "infra" {
             backend = "azurerm"
             config = {
               resource_group_name  = "tfstate-rg"
               storage_account_name = "tfstate4807"
               container_name       = "tfstate"
               key                  = "infra.tfstate"
             }
           }
          
        3. Use the azure-app module:
          
           module "my_app" {
             source = "git::https://github.com/nelsong6/infra-bootstrap.git//modules/azure-app?ref=main"
               
             resource_group_name = data.terraform_remote_state.infra.outputs.resource_group_name
             location            = data.terraform_remote_state.infra.outputs.resource_group_location
             dns_zone_name       = data.terraform_remote_state.infra.outputs.dns_zone_name
             dns_zone_id         = data.terraform_remote_state.infra.outputs.dns_zone_id
               
             app_name                = "myapp"
             custom_domain_subdomain = "myapp"
             github_repo             = "owner/repo"
             container_image         = "ghcr.io/owner/repo/api:latest"
               
             cosmos_db_config = {
               database_name = "MyAppDB"
               containers = [{
                 name                = "items"
                 partition_key_paths = ["/userId"]
               }]
             }
           }
          
        For detailed documentation, see: modules/azure-app/README.md
          
        ====================================================================================================
    EOT -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so OpenTofu can't
guarantee to take exactly these actions if you run "tofu apply" now.
```
</details>